Обработки/Reports/_РасшифровкаРасчетовРезервовПоАктивам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаРасчетовРезервовПоАктивам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказательНаВременноеХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаРасчетовРезервовПоАктивам/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расшифровка расчетов резервов по активам",
		"0.04",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	РаботаСОтчетами.КонтрольВалютыРасходовПоСделкамОтличнойОтВалютыУчета(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Период, КонецДня(ЭтотОбъект.Период));
	
	Настройки = КомпоновщикНастроек.Настройки;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачалаПериода", 					ЭтотОбъект.Период);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаОкончанияПериода", 				КонецДня(ЭтотОбъект.Период));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", 					ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка, ПараметрыВыводаПодписей);
	
	МассивСчетовСНГ = РегистрыСведений.КлиентыДоверительногоУправления.СчетаДоверительногоУправленияКлиента(
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Клиент_НПФ_СНГ"),
																				ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"),
																				КонецДня(ЭтотОбъект.Период));
																				
	ЭтоКлиентСНГ = (МассивСчетовСНГ.Найти(ЭтотОбъект.СчетДоверительногоУправления) <> Неопределено);																				
	
	Если ЭтоКлиентСНГ Тогда
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТаблицаНачисленныхРезервов = ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
		
		ДокументНачисленияРезерва = Документы.НачислениеСписаниеРезервов.СоздатьДокумент();
		
		ТаблицаPD = ДокументНачисленияРезерва.ПолучитьТаблицуPD("СНГШкалаPD");
		ТаблицаPD.Свернуть("СтрокаРейтинга, PD","");
		
		СтрокаНеОпределен = ТаблицаPD.Добавить();
		СтрокаНеОпределен.СтрокаРейтинга = "Не определен";
		СтрокаНеОпределен.PD = 32.09;
		
		МассивКонтрагентовМНОДепозитов = Новый Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(МНО.РасчетныйСчет.ДоговорМНО.Контрагент) КАК Контрагент,
		|	МНО.Ссылка КАК Актив
		|ИЗ
		|	Документ.МНО КАК МНО
		|ГДЕ
		|	МНО.Ссылка В(&МассивАктивов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ДепозитныеВклады.БанковскийСчет.Договор.Контрагент),
		|	ДепозитныеВклады.Ссылка
		|ИЗ
		|	Справочник.ДепозитныеВклады КАК ДепозитныеВклады
		|ГДЕ
		|	ДепозитныеВклады.Ссылка В(&МассивАктивов)";
		
		Запрос.УстановитьПараметр("МассивАктивов", ТаблицаНачисленныхРезервов.ВыгрузитьКолонку("Актив"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Контрагент) Тогда
				
				СтруктураКонтрагента = Новый Структура;
				СтруктураКонтрагента.Вставить("Актив", ВыборкаДетальныеЗаписи.Актив);
				СтруктураКонтрагента.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
				
				МассивКонтрагентовМНОДепозитов.Добавить(СтруктураКонтрагента);
				
			КонецЕсли;
		КонецЦикла;
		
		МассивЦенныхБумагРЕПО = Новый Массив;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПРЕДСТАВЛЕНИЕ(СделкаРЕПОЦенныеБумаги.ЦеннаяБумага) КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА СделкаРЕПОЦенныеБумаги.Ссылка.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(СделкаРЕПОЦенныеБумаги.Ссылка.Контрагент)
		|		ИНАЧЕ ПРЕДСТАВЛЕНИЕ(СделкаРЕПОЦенныеБумаги.Ссылка.Брокер)
		|	КОНЕЦ КАК Контрагент,
		|	ВЫБОР
		|		КОГДА СделкаРЕПОЦенныеБумаги.Ссылка.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ПРЕДСТАВЛЕНИЕ(СделкаРЕПОЦенныеБумаги.Ссылка.Договор)
		|		ИНАЧЕ КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.ДоговорБрокерскогоОбслуживания.НомерДоговора
		|	КОНЕЦ КАК Договор,
		|	СделкаРЕПОЦенныеБумаги.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СделкаРЕПО.ЦенныеБумаги КАК СделкаРЕПОЦенныеБумаги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(&ДатаОкончанияПериода, ) КАК КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних
		|		ПО (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Организация = СделкаРЕПОЦенныеБумаги.Ссылка.Организация)
		|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.СчетДоверительногоУправления = СделкаРЕПОЦенныеБумаги.Ссылка.СчетДоверительногоУправления)
		|			И (КодыСчетовДоверительногоУправленияУБрокеровСрезПоследних.Брокер = СделкаРЕПОЦенныеБумаги.Ссылка.Брокер)
		|ГДЕ
		|	СделкаРЕПОЦенныеБумаги.Ссылка В(&МассивАктивов)
		|	И СделкаРЕПОЦенныеБумаги.НомерСтроки = 1";
		
		Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецДня(ЭтотОбъект.Период));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
				
				СтруктураКонтрагента = Новый Структура;
				СтруктураКонтрагента.Вставить("Актив", ВыборкаДетальныеЗаписи.Ссылка);
				СтруктураКонтрагента.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
				СтруктураКонтрагента.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
				СтруктураКонтрагента.Вставить("ЦеннаяБумага", ВыборкаДетальныеЗаписи.ЦеннаяБумага);
				
				
				МассивЦенныхБумагРЕПО.Добавить(СтруктураКонтрагента);
				
			КонецЕсли;
		КонецЦикла;
		
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
		
		СтруктураВозврата = Новый Структура;
		
		СтруктураВозврата.Вставить("ОсновнаяТаблица", РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ТаблицаНачисленныхРезервов));
		СтруктураВозврата.Вставить("ТаблицаPD", РаботаСКоллекциями.ТаблицаЗначений_В_МассивСтруктур(ТаблицаPD));
		СтруктураВозврата.Вставить("МассивКонтрагентовМНОДепозитов", МассивКонтрагентовМНОДепозитов);
		СтруктураВозврата.Вставить("МассивЦенныхБумагРЕПО", МассивЦенныхБумагРЕПО);
		СтруктураВозврата.Вставить("ЮрФизЛицо", Строка(РаботаСНормативноСправочнойИнформацией.ПолучитьЮрФизЛицоСчетаДоверительногоУправления(ЭтотОбъект.СчетДоверительногоУправления, КонецДня(ЭтотОбъект.Период))));
		СтруктураВозврата.Вставить("СчетДоверительногоУправленияНомер", "");
		СтруктураВозврата.Вставить("СчетДоверительногоУправленияДатаЗаключения", "");
		СтруктураВозврата.Вставить("ДоверительныйУправляющий", "");
		СтруктураВозврата.Вставить("СчетДоверительногоУправленияНаименование", "");
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ПРЕДСТАВЛЕНИЕ(СчетаДоверительногоУправления.Организация.ЮрФизЛицо) КАК ОрганизацияПредставление,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу,
		|	СчетаДоверительногоУправления.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ДатаОкончанияПериода, ) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО СчетаДоверительногоУправления.Организация.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
		
		Запрос.УстановитьПараметр("СчетДоверительногоУправления",	ЭтотОбъект.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураВозврата.Вставить("СчетДоверительногоУправленияНомер", СокрЛП(ВыборкаДетальныеЗаписи.НомерДоговора));
			СтруктураВозврата.Вставить("СчетДоверительногоУправленияДатаЗаключения", Формат(ВыборкаДетальныеЗаписи.ДатаЗаключения, "ДФ=dd.MM.yyyy"));
			СтруктураВозврата.Вставить("ДоверительныйУправляющий", СокрЛП(ВыборкаДетальныеЗаписи.ОрганизацияПредставление));
			СтруктураВозврата.Вставить("СчетДоверительногоУправленияНаименование", СокрЛП(ВыборкаДетальныеЗаписи.Наименование));
		КонецЦикла;
		
		УказательНаВременноеХранилище = ПоместитьВоВременноеХранилище(СтруктураВозврата, УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
